import * as T from '../type';

export default [
  {
    id: T.GHQ,
    title: 'মানসিক অবস্থা যাচাইকরণ',
    description:
      'এখানে ১২টি প্রশ্ন আছে যেগুলো উত্তর দেওয়ার মাধ্যমে আপনি আপনার মানসিক অবস্থা (সাধারণ, মাঝামাঝি, তীব্র মাত্রা) সম্পর্কে একটি ধারণা পাবেন।',
  },
  {
    id: T.PSS,
    title: 'মানসিক চাপ নির্ণয়',
    description:
      'এখানে ১০টি প্রশ্নবিশিষ্ট একটি স্কেল রয়েছে যার মাধ্যমে খুব সহজেই আপনি আপনার মানসিক চাপ পরিমাপ করতে পারেন।',
    copyright: 'এই স্কেলটি বাংলা অনুবাদ করেছেন মোঃ জিয়াউল ইসলাম'
  },
  {
    id: T.ANXIETY,
    title: 'দুশ্চিন্তা নির্ণয়',
    description:
      'এখানে ৩৬ টি প্রশ্নবিশিষ্ট একটি স্কেল রয়েছে যার মাধ্যমে খুব সহজেই আপনি আপনার দুশ্চিন্তা পরিমাপ করতে পারেন। ',
    copyright: 'এই স্কেলটি ডেভেলপ করেছেন ড. ফারাহ দিবা'
  },
];
