const s = [
  'আমি পরিচিত সামাজিক স্বচ্ছন্দ বোধ করি',
  'সামাজিকতা মানতে বাধ্য করে এমন অবস্থা আমি এড়িয়ে চলতে চেষ্টা করি',
  'অপরিচিত লোকের মাঝেও আমি স্বচ্ছন্দ বোধ করি',
  'মানুষকে এড়িয়ে চলার পিছনে আমার কোনো বিশেষ উদ্দেশ্য নেই',
  'আমি প্রায় সামাজিক অনুষ্ঠান সমূহকে বিশৃংখল দেখি',
  'আমি সাধারনত সামাজিক অনুষ্ঠানে স্বচ্ছন্দ বোধ করি',
  'আমি বিপরীত লিঙ্গের কারো সাথে কথোপকথনের সময় সাধারনত থাকি',
  'আমি ভালোভাবে কাউকে না জানা পর্যন্ত তাদের সাথে কথোপকথন এড়িয়ে চলি',
  'যদি কোন নতুন ব্যক্তির সাথে পরিচয়ের সুযোগ আসে তাহলে আমি প্রায়ই তা গ্রহণ করি',
  'পুরুষ ও মহিলা উভয়ের উপস্থিতিতে কোন ঘরোয়া প্রীতি সম্মেলনে যোগদান করতে আমি ভীষণ ভাবে নার্ভাস বোধ করি',
  'ভালোভাবে কাউকে না জেনে লোকজনের সাথে মিশতে আমি সাধারনত নার্ভাস হয়ে পড়ি',
  'আমি সাধারনত অনেক লোকের সাথে থাকতে স্বচ্ছন্দ বোধ করি',
  'আমি প্রায়ই লোকজন থেকে দূরে থাকতে চাই',
  'অপরিচিত কোন লোকজনের সাথে থাকতে আমি সাধারনত অস্বস্তি বোধ করি',
  'কারো সাথে প্রথম পরিচয়ে আমি স্বচ্ছন্দ বোধ করি',
  'কারো সাথে পরিচিত হওয়ার সময় আমি উত্তেজিত ও নার্ভাস হয়ে পড়ি',
  'ঘরভর্তি অপরিচিত লোকের মধ্যে আমি যে কোন ভাবেই প্রবেশ করতে পারি',
  'আমি নিজে ইচ্ছায় কোনো বড় সমাবেশে যোগদান করি না',
  'বয়োজ্যেষ্ঠরা যখন আমার সাথে কথা বলতে চান তখন আমি আগ্রহ ভরে তাদের সাথে কথা বলি',
  'আমি যখন একদল লোকের মাঝে থাকি তখন প্রায়ই আমার মনে হয় আমি যেন কিনারে দাঁড়িয়ে আছি',
  'আমি লোকজন থেকে নিজেকে দূরে সরিয়ে রাখতে ভালোবাসি',
  'কোন ঘরোয়া বা সামাজিক অনুষ্ঠানে লোকজনের সাথে কথা বলতে আমি সংকোচ বোধ করিনা',
  'আমি বড় কোন সমাবেশে কদাচিৎ সহজ হতে পারি',
  'সামাজিক কোনো অনুষ্ঠান এড়াতে আমি প্রায়ই অজুহাত  খুঁজি',
  'লোকজনের সাথে পরস্পর পরিচয় করিয়ে দিতে আমি কখনও কখনও দায়িত্ব গ্রহণ করে থাকি',
  'আনুষ্ঠানিক কোনো সামাজিক অনুষ্ঠান আমি এড়াতে চেষ্টা করি',
  'আমি সাধারনত সব ধরনের সামাজিক অনুষ্ঠানেই যাই',
  'আমি সহজে অপরের সাথে মিশে আনন্দ উপভোগ করি',
].map((q, mainIndex) => ({
  question: q,
  options: ['সত্য', 'মিথ্যা'].map((o, i) => {
    if (
      [1, 4, 7, 9, 10, 12, 13, 15, 17, 19, 20, 22, 23, 25].includes(mainIndex)
    ) {
      return {
        label: o,
        value: 1 - i,
        weight: 1 - i,
      };
    }
    return {
      label: o,
      value: i,
      weight: i,
    };
  }),
}));

const genId = (name) => name.toLowerCase().split(' ').join('_');

const test = {
  id: genId('Social avoidance and distress scale'),
  name: 'Social avoidance and distress scale',
  needToEvaluate: true,
  ques: s,
  range: [
    {
      min: 0,
      max: 5,
      severity: 'সর্বনিম্ন',
    },
    {
      min: 6,
      max: 15,
      severity: 'মধ্যম',
    },
    {
      min: 16,
      max: 28,
      severity: 'সর্বোচ্চ',
    },
  ],
};

const fs = require('fs');
fs.writeFileSync('hmm.json', JSON.stringify(test));

// const s = [
//   'আমি আশা এবং উৎসাহ নিয়ে ভবিষ্যতের অপেক্ষায় আছি',
//   'আমি সব আশা ছেড়ে দিয়েছি কারণ নিজের ভাল কোন কিছু করার জন্য আমার আর কিছুই করার নেই',
//   'যখন খারাপ সময়ের ভেতর দিয়ে যাই, তখন আমি বুঝতে পারি যে সময় সবসময় খারাপ যাবে না',
//   '১০ বছর পর আমার জীবন কেমন হবে তা আমি কল্পনাও করতে পারি না',
//   'আমি যেসব কাজ খুব বেশি করতে চাই,  তা শেষ করার মতো যথেষ্ট সময় আমার আছে',
//   'যেসব বিষয়/ কাজ নিয়ে আমি উদ্বিগ্ন থাকি আমি আশা করি যে ভবিষ্যতে আমি সেসব বিষয়ে সফল হব',
//   'আমার মনে হয় আমার ভবিষ্যৎ অন্ধকারাচ্ছন্ন',
//   'আমি সাধারন ভাবে একজন ভাগ্যবান এবং জীবনের ভালো জিনিস গুলোর অধিকাংশ একজন সাধারন মানুষ অপেক্ষা বেশি পাওয়ার আশা করি',
//   'আমি বিশ্রাম নেয়ার কোনো সুযোগই পাইনা আর ভবিষ্যতে যে পাব তা বিশ্বাস করার মতো কোনো কারণও নেই',
//   'অতীত অভিজ্ঞতা গুলো আমাকে ভবিষ্যতের জন্য সুন্দরভাবে তৈরি করে দিয়েছে',
//   'আমি আমার সামনে আনন্দের পরিবর্তে শুধু নিরানন্দ দেখি',
//   'আমি পেতে চাই তা পাওয়ার কোনো আসা আমার নাই',
//   'আমি আশা করি ভবিষ্যতে আমি বর্তমান অবস্থার চেয়ে বেশি সুখে থাকবো',
//   'আমি যে ভাবে চাই কোন কিছুই সেভাবে পাইনা',
//   'ভবিষ্যৎ সম্পর্কে আমি বেশ আস্থাশীল',
//   'আমি চাই তা কখনোই পাইনা, তাই নিজের জন্য চাওয়াটা বোকামি',
//   'ভবিষ্যতে আমার প্রকৃতই সুখী/ তৃপ্ত হবার (অর্থাৎ আমি প্রকৃতপক্ষে সন্তুষ্ট থাকব)  সম্ভাবনা খুবই কম',
//   'ভবিষ্যৎ আমার  কাছে অস্পষ্ট  এবং অনিশ্চিত',
//   'আমি খারাপ সময়ের চাইতে ভালো সময়ের জন্য বেশি অপেক্ষা করবো',
//   'কোন কিছু পাওয়ার জন্য চেষ্টা করার কোন মানে হয় না, কারণ সম্ভবতঃ সেটা পাওয়া যাবে না',
// ].map((q, mainIndex) => ({
//   question: q,
//   options: ['সত্য', 'মিথ্যা'].map((o, i) => {
//     if ([0, 2, 4, 5, 7, 9, 12, 14, 18].includes(mainIndex)) {
//       return {
//         label: o,
//         value: i,
//         weight: i,
//       };
//     }
//     return {
//       label: o,
//       value: 1 - i,
//       weight: 1 - i,
//     };
//   }),
// }));

// const genId = (name) => name.toLowerCase().split(' ').join('_');

// const test = {
//   id: genId('Hopelessness Scale (Beck)'),
//   name: 'Hopelessness Scale (Beck)',
//   needToEvaluate: true,
//   ques: s,
//   range: [
//     {
//       min: 0,
//       max: 3,
//       severity: 'None or minimal',
//     },
//     {
//       min: 4,
//       max: 8,
//       severity: 'Mild',
//     },
//     {
//       min: 9,
//       max: 14,
//       severity: 'Moderate',
//     },
//     {
//       min: 15,
//       max: 100000,
//       severity: 'Severe',
//     },
//   ],
// };

// const fs = require('fs');
// fs.writeFileSync('hmm.json', JSON.stringify(test));

// Dhaka University Cognitive Distortion Scale (DUCDS)
// const s = [
//   'জীবনে আমি কিছুই অর্জন করিনি',
//   'সবাইকে খুশি করতে না পারলে আমি সম্পূর্ণরূপে ব্যর্থ',
//   'সফল হবার মত কোন যোগ্যতাই আমার নেই',
//   'আমি আমার প্রিয়জনদের  কোন স্বপ্নই পূরণ করতে পারি নাই',
//   'অন্যের সাথে সঠিক ভাবে কথা বলতে না পারা মানেই আমি অসামাজিক',
//   'কখনো যদি কাউকে আমি আঘাত দেই, তাহলে আমি দিনে দিনে সবার কাছে আরো খারাপ হয়ে যাবো',
//   'সবাইকে আমার প্রতি আকৃষ্ট করতে না পারলে আমার জীবন অর্থহীন',
//   'জীবনে কখনো কোন সুযোগ থেকে বঞ্চিত হওয়া অর্থই আমি সব সময়ের জন্য অবহেলিত',
//   'পৃথিবীতে এমন কেউ নেই যে আমাকে বুঝে',
//   'সামাজিক সম্পর্কে শুধু অশান্তিই সৃষ্টি হয়',
//   'প্রিয়জনদের কাছে শুধু অবহেলাই পাই',
//   'মানুষ মাত্রই সুযোগ সন্ধানী',
//   'দুঃখই আমার জীবনের একমাত্র সঙ্গী',
//   'অন্যরা ভাবে যে, আমি কোন কাজ সঠিক ভাবে করতে পারি না',
//   'অন্যরা আমাকে বোকা ভাবে',
//   'সবাই আমার দুর্বলতার কথা জানে',
//   'জীবনে আমার আর সুখ আসবে না',
//   'সবাই ভাবে আমি ভীতু, কাপুরুষ',
//   'অশান্তি আমার সারা জীবনের সঙ্গী হয়ে থাকবে',
//   'কোন চিকিৎসাই আমাকে সুস্থ করতে পারবে না',
//   'কেউই আমাকে নির্ভরযোগ্য মানুষ মনে করে না',
//   'আমাকে খুশী করার জন্যই সবসময় অন্যরা আমার প্রশংসা করে',
//   'আমার মন বলে, আমি যেমনটা আশা করি তা কখনো হয় না',
//   'আমি যতই চেষ্টা করি না কেন কোন কাজের দায়িত্ব নিলে তা খারাপ হবেই',
//   'বন্ধুদের তুলনায় সর্বত্র আমার সফলতার চেয়ে ব্যর্থতাই বেশী',
//   'যদি আমার সমস্যা অন্যরা জেনে যায় তবে তা আমার জন্য ভীষণ লজ্জাজনক',
//   'আমাকে সব ক্ষেত্রেই নিখুঁত হতে হবে',
//   'আমার পরিবারের উচিৎ আমার প্রতিটি অনুভূতিকে সঠিক ভাবে মূল্যায়ন করা',
//   'আমি যাদের ভালবাসি, তাদের সবার উচিৎ আমাকে ভালবাসা',
//   'সব ক্ষেত্রে আমাকে বিচক্ষন হতে হবে',
//   'আমার উচিৎ সবাইকে সন্তুষ্ট  করে চলা',
//   'অবশ্যই সর্বক্ষেত্রে আমাকে একজন সফল মানুষ হতে হবে',
//   'আমাকে উচ্চ পদমর্যাদা অর্জন করতেই হবে',
//   'আমার কোন ভুলই করা উচিৎ না',
//   'অন্যদের সাথে আমার সম্পর্ক থাকে না কারন আমি ভালো সম্পর্ক ধরে রাখতে পারি না',
//   'আমার জীবন নষ্টের কারন আমি নিজেই',
//   'আমার পাপের শাস্তি হিসেবেই সৃষ্টিকর্তা আমাকে কষ্ট দিয়েছেন',
//   'আমার কারনেই আমার আপনজনদের লজ্জায় পরতে হয়',
//   'আমি অন্যের অমঙ্গলের কারন',
// ].map((q) => ({
//   question: q,
//   options: [
//     'কখনোই মনে হয় না',
//     'খুবই কম মনে হয়',
//     'মাঝে মাঝে মনে হয়',
//     'বেশীর ভাগ সময় মনে হয়',
//     'সব সময়ই মনে হয়',
//   ].map((o, i) => ({
//     label: o,
//     value: i,
//     weight: i,
//   })),
// }));

// const genId = (name) => name.toLowerCase().split(' ').join('_');

// const test = {
//   id: genId('Dhaka University Cognitive Distortion Scale (DUCDS)'),
//   name: 'Dhaka University Cognitive Distortion Scale (DUCDS)',
//   needToEvaluate: true,
//   ques: s,
//   range: [
//     {
//       min: 0,
//       max: 55,
//       severity: 'Cut-off Score',
//     },
//     {
//       min: 56,
//       max: 72,
//       severity: 'Mild',
//     },
//     {
//       min: 73,
//       max: 91,
//       severity: 'Moderate',
//     },
//     {
//       min: 92,
//       max: 109,
//       severity: 'Severe',
//     },
//     {
//       min: 110,
//       max: 100000,
//       severity: 'Profound',
//     },
//   ],
// };

// const fs = require('fs');
// fs.writeFileSync('hmm.json', JSON.stringify(test));

// Somatic Complaints Scale
// const s = [
//   'আমার স্বাস্থ্যগত অবস্থা আমার কাজকর্ম সীমিত করে দিয়েছে',
//   'আমার এমন অসুস্থতা রয়েছে যা ডাক্তাররা ধরতে পারছেন না',
//   'আমার শরীরের কোনো কোনো অংশে আমি অবশ বোধ করি যা আমি বোঝাতে পারি না',
//   'কখনো কখনো আমি একই জিনিস দুটো করে দেখি বা ঝাপসা দেখি',
//   'কখনো কখনো আমার দৃষ্টিশক্তি খারাপ হয়ে যায় আবার সেটা ভালও হয়ে যায়',
//   'মাঝেমাঝে আমার হাতে কোন বোধশক্তি থাকেনা',
//   'কখনো কখনো আমার পা দুটি এতই দুর্বল হয় যে আমি হাঁটতে পারিনা',
//   'মাঝেমাঝে আমার শরীরের কোন কোন অংশ অবশ হয়ে যায়',
//   'বেশীর ভাগ সময়ই আমি সুস্থ বোধ করিনা',
//   'আমি ভীষণ ব্যথা-বেদনায় ভুগি',
//   'আমার স্বাস্থ্য ভাল',
//   'আমার শারীরিক অবস্থা নিয়ে আমি খুব কমই অভিযোগ করি',
//   'আমার গুরুতর পিঠের ব্যথা আছে',
//   'আমার পাকস্থলী দুর্বল',
//   'বেশীরভাগ মানুষের তুলনায় আমার ঘনঘন মাথাব্যথা হয়',
//   'আমার ঘনঘন ডায়রিয়া হয়',
//   'আমি বছরের পর বছর অনেক ডাক্তার দেখিয়েছি',
//   'আমার স্বাস্থ্য সমস্যাগুলো খুব জটিল',
//   'আমার শারীরিক সমস্যাগুলো নিয়ে কাজকর্ম করা আমার জন্য কষ্টকর',
//   'আমার শারীরিক সমস্যাগুলোর চিকিৎসকরা সব সময় কঠিন বলে মনে করে',
//   'আমার যে ধরনের স্বাস্থ্য সমস্যা আছে তা বেশীরভাগ মানুষের মধ্যেই দেখা যায়',
//   'আমার মধ্যে কিছু অস্বাভাবিক রোগ ও অসুস্থতা আছে',
//   'আমার বয়স অনুপাতে আমার স্বাস্থ্য খুবই ভালো',
//   'আমি মানুষের সাথে তাদের শারীরিক সমস্যা নিয়ে কথা বলতে পছন্দ করি',
// ].map((q, i) => ({
//   question: q,
//   options: [
//     'একেবারে সত্য',
//     'কিছুটা সত্য',
//     'বেশির ভাগ সত্য',
//     'পুরোপুরি সত্য',
//   ].map((o, j) => {
//     if ([10, 11, 20, 22].includes(i)) {
//       return {
//         label: o,
//         value: j,
//         weight: 3 - j,
//       };
//     } else {
//       return {
//         label: o,
//         value: j,
//         weight: j,
//       };
//     }
//   }),
// }));

// const genId = (name) => name.toLowerCase().split(' ').join('_');

// const test = {
//   id: genId('Somatic Complaints Scale'),
//   name: 'Somatic Complaints Scale',
//   needToEvaluate: true,
//   ques: s,
//   range: [
//     {
//       min: 0,
//       max: 28,
//       severity: 'Cut-off Score',
//     },
//     {
//       min: 29,
//       max: 42,
//       severity: 'Mild',
//     },
//     {
//       min: 43,
//       max: 50,
//       severity: 'Moderate',
//     },
//     {
//       min: 51,
//       max: 55,
//       severity: 'Severe',
//     },
//     {
//       min: 56,
//       max: 72,
//       severity: 'Profound',
//     },
//   ],
// };

// const fs = require('fs');
// fs.writeFileSync('hmm.json', JSON.stringify(test));

// // Dhaka University Obsessive Compulsive Scale (DUOCS)
// const s = [
//   'আমার মাথায় ধর্ম নিয়ে নানান ধরনের অদ্ভূত  এবং বাজে চিন্তা আসে যা আমি চাইলেও থামাতে পারি না',
//   'পবিত্র স্থানকে  অপবিত্র করছি এমন কল্পনা বা ছবি আসে মনে , আমি চাইলেও তা মন থেকে সরাতে পারি না',
//   'নাস্তিকবাদী চিন্তা  আমার মনের মধ্যে এত বারবার আসতে থাকে যে মনে হয় আমার ঈমান (সৃষ্টিকর্তার প্রতি বিশ্বাস)  নষ্ট হয়ে গেছে',
//   'সারাক্ষণ সন্দেহ হয় আমি বুঝিনা নাপাক, নোংরা বা অশুচি হয়ে গেছি',
//   'সারাক্ষণ মনে হয় আমার গায়ে হাতে ময়লা বা জীবাণু লেগে আছে',
//   'কোন কিছু পরিষ্কার করার সময় অনেকবার বা অনেক সময় লাগিয়ে  ধুই ,  যদিও বুঝি এতবার ধোয়ার দরকার নেই,  কিন্তু না ধুয়ে পারি না',
//   'পরিষ্কার পরিচ্ছন্নতার জন্য আমাকে প্রচুর পরিমাণ সাবান বা ডিটারজেন্ট পাউডার ব্যবহার করতে হয়',
//   'যেখানে নোংরা থাকতে পারে ওইসব স্থান সম্পর্কে আমি অতিরিক্ত সচেতন থাকি এবং প্রায়শই এড়িয়ে চলি',
//   'আমার গায়ে  কারো স্পর্শ লাগলে আমি গোসল বা পরিস্কার না হওয়া পর্যন্ত অশান্তিতে ভুগতে থাকি',
//   'গোসল করতে আমার প্রচুর সময় এমনকি কয়েক ঘন্টাও  লেগে যায়',
//   'কোন কাজ করার মাঝে আমার যদি মনে চিন্তা আসে নাপাক হয়ে  গেছি,  তাহলে আমি তৎক্ষণাৎ  আমি গোসলে যাই বা পরিচ্ছন্ন হতে চাই',
//   'বিভিন্ন জিনিস আমি বারবার পরীক্ষা করে দেখি',
//   'নামাজ/ উপাসনা করতে গেলে সন্দেহ লাগে হয়তো সূরা/ শ্লোক ঠিকমত পড়া হয়নি, তখন আবার পড়ি, এভাবে অনেক সময় লেগে যায়',
//   'হিসাব করতে আমার খুব অসুবিধা হয়, শুধু মনে হয় বুঝি গোনায় ভুল হয়ে গেল',
//   'আমার মনের মতো না হওয়া পর্যন্ত আমি একই কাজ বারবার করতে থাকে',
//   'বিভিন্ন জিনিস আমি একটি নির্দিষ্ট    সংখ্যক বার করি',
//   'প্রাত্যহিক কাজ করতে আমার প্রচুর সময় লাগে  বা  প্রায় কোন কাজই সময় মত করতে পারি না',
//   'কোন কাজ করার সময় যদি আমার নির্ধারিত ধারাবাহিকতায় কোন ছেদ পড়ে বা বিঘ্ন ঘটে তবে সে কাজটি আমাকে আবার প্রথম থেকে শুরু করতে হয়',
//   'আমি বুঝি আমি এমন কিছু আচরণ করি  যা অতিরিক্ত এবং অপ্রজনীয় , কিন্তু তারপরও না করে পারি না',
//   'কিছু কিছু ব্যাপার নিয়ে আমি অতিরিক্ত খুঁতখুঁতে বলে অন্যরা প্রায়ই আমার উপর বিরক্ত হয়',
// ].map((q) => ({
//   question: q,
//   options: [
//     'একেবারেই নেই',
//     'খুবই সামান্য',
//     'সামান্য',
//     'একটু বেশি',
//     'অনেক বেশি',
//   ].map((o, i) => ({
//     label: o,
//     value: i,
//     weight: i,
//   })),
// }));

// const genId = (name) => name.toLowerCase().split(' ').join('_');

// const test = {
//   id: genId('Dhaka University Obsessive Compulsive Scale (DUOCS)'),
//   name: 'Dhaka University Obsessive Compulsive Scale (DUOCS)',
//   needToEvaluate: true,
//   ques: s,
//   range: [
//     {
//       min: 0,
//       max: 17,
//       severity: 'Cut-off Score',
//     },
//     {
//       min: 18,
//       max: 23,
//       severity: 'Mild',
//     },
//     {
//       min: 24,
//       max: 40,
//       severity: 'Moderate',
//     },
//     {
//       min: 41,
//       max: 49,
//       severity: 'Severe',
//     },
//     {
//       min: 50,
//       max: 80,
//       severity: 'Profound',
//     },
//   ],
// };

// const fs = require('fs');
// fs.writeFileSync('hmm.json', JSON.stringify(test));

// Depression Scale

// const s = [
//   'আমার অশান্তি লাগে',
//   'ইদানিং আমি মন মরা থাকি',
//   'আমার ভবিষ্যত অন্ধকার',
//   'ভবিষ্যতে আমার অবস্থা দিন দিন আরো খারাপ হবে',
//   'আমার সব শেষ হয়ে গেছে',
//   'আমি মনে করি যে , জীবনটা বর্তমানে খুব বেশি কষ্টকর',
//   'বর্তমানে আমি অনুভব করি যে মানুষ হিসাবে আমি সম্পূর্ণ ব্যর্থ',
//   'আমি কোথাও আনন্দ ফুর্তি পাই না',
//   'নিজেকে খুব ছোট মনে হয়',
//   'সবকিছুতে আমার আত্নবিশ্বাস কমে গেছে',
//   'আমার মনে হয় মানুষ আমাকে করুণা করে',
//   'জীবনটা অর্থহীন',
//   'প্রায়ই আমার কান্না পায়',
//   'আমি প্রায়ই বিরক্ত বোধ করি',
//   'আমি কোন কিছুতেই আগ্রহ পাই না',
//   'আমি ইদানিং চিন্তা করতে ও সিদ্ধান্ত নিতে পারি না',
//   'আমি আজকাল অনেক কিছুতেই মনোযোগ দিতে পারি না',
//   'আমি আগের মতো মনে রাখতে পারি না',
//   'আমি দুর্বল বোধ করি এবং অল্পতেই ক্লান্ত হয়ে পরি',
//   'আমি এখন কম ঘুমাই',
//   'আমি এখন বেশি ঘুমাই',
//   'আমার মেজাজ খিটখিটে হয়ে গেছে',
//   'আমার ক্ষুধা কমে গেছে',
//   'আমার ক্ষুধা বেড়ে গেছে',
//   'আমার ওজন কমে গেছে ( ইচ্ছাকৃতভাবে ওজন নিয়ন্ত্রণের চেষ্টা করার ফলে নয় )					',
//   'আমার মনে হয় যে আমার কাজকর্মের গতি কমে গেছে',
//   'হাসির কোন ঘটনা ঘটলেও আমি আর হাসতে পারি না',
//   'যৌন বিষয়ে আমার আগ্রহ কমে গেছে',
//   'সামাজিক কাজকর্মে আগের মতো অংশগ্রহণ করতে পারি না',
//   'শিক্ষা বা পেশাগত কাজকর্ম আগের মতো করতে পারি না',
// ].map((q) => ({
//   question: q,
//   options: [
//     'একেবারেই প্রযোজ্য নয়',
//     'প্রযোজ্য নয়',
//     'মাঝামাঝি',
//     'কিছুটা প্রযোজ্য',
//     'পুরোপুরি প্রযোজ্য',
//   ].map((o, i) => ({
//     label: o,
//     value: i + 1,
//     weight: i + 1,
//   })),
// }));

// const test = {
//   name: 'Depression Scale',
//   ques: s,
//   range: [
//     {
//       min: 30,
//       max: 93,
//       severity: 'Minimal',
//     },
//     {
//       min: 94,
//       max: 100,
//       severity: 'Depressed',
//     },
//     {
//       min: 101,
//       max: 114,
//       severity: 'Mild',
//     },
//     {
//       min: 115,
//       max: 123,
//       severity: 'Moderate',
//     },
//     {
//       min: 124,
//       max: 150,
//       severity: 'Severe',
//     },
//   ],
// };

// const fs = require('fs');
// fs.writeFileSync('hmm.json', JSON.stringify(test));
