import YesNo from './YesNo';

export default {
  questions: [
    {
      question:
        'করোনায় আক্রান্ত রোগীর লক্ষন (জ্বর, সর্দি, কাশি ইত্যাদি) আপনার মধ্যে বিদ্যমান?',
      options: YesNo,
    },
    {
      question:
        'করোনায় আক্রান্ত রোগীর লক্ষন (জ্বর, সর্দি, কাশি ইত্যাদি) আপনার কাছের মানুষদের মধ্যে বিদ্যমান?',
      options: YesNo,
    },
    {
      question:
        'করোনা পরিস্থিতি উদ্ভুত হওয়ার পূর্বে আপনার কি কোনো মানসিক স্বাস্থ্য সমস্যা দেখা দিয়েছিল?',
      options: YesNo,
    },
    {
      question: 'যদি হ্যাঁ হয় তাহলে সেজন্য কি কোন চিকিৎসা নিয়েছিলেন?',
      options: YesNo,
    },
    {
      question:
        'করোনা পরিস্থিতি উদ্ভুত হওয়ার পরে/ এই পরিস্থিতির কারণে আপনার কি কোনো মানসিক স্বাস্থ্য সমস্যা দেখা দিয়েছে?',
      options: YesNo,
    },

    {
      question: 'যদি হ্যাঁ হয় তাহলে সেজন্য কি কোন চিকিৎসা নিয়েছিলেন?',
      options: YesNo,
    },
  ],
};
