const getAnswers = (weights) => [
  {
    label: 'সবসময়',
    value: 5,
    weight: weights[5],
  },
  {
    label: 'বেশিরভাগ সময়',
    value: 4,
    weight: weights[4],
  },
  {
    label: 'অর্ধেকের বেশি সময়',
    value: 3,
    weight: weights[3],
  },
  {
    label: 'অর্ধেকের কম সময়',
    value: 2,
    weight: weights[2],
  },
  {
    label: 'মাঝে মাঝে',
    value: 1,
    weight: weights[1],
  },
  {
    label: 'কখনোই না',
    value: 0,
    weight: weights[0],
  },
];

export const severityText = [
  'এই স্কোরের মানে হল আপনার মানসিক অবস্থা স্বাভাবিক। তারপরও খেয়াল রাখতে হবে যে, আপনি আপনার দৈনন্দিন কাজ গুলো করতে পারছেন কিনা। যদি না পারেন তাহলে পরবর্তী ধাপগুলো অতিক্রম করুন। ',
  'এই স্কোরের মানে হল আপনার মানসিক স্বাস্থ্য সম্পর্কে আরও সতর্ক ও যত্নশীল হতে হবে। আপনি অনুগ্রহ করে পরবর্তী ধাপগুলো অতিক্রম করুন।',
];

export const socreMessage =
  'গবেষণালদ্ধ তথ্য মতে যেকোন সংকটপূর্ণ অবস্থা দীর্ঘস্থায়ী হলে মানুষের মানসিক চাপ ও দুশ্চিন্তা বৃদ্ধি পায় এবং মানসিক অবস্থার অবনতি ঘটে । আপনি আপনার বর্তমান মানসিক অবস্থা,মানসিক চাপ ও দুশ্চিন্তা পরিমাপ করুন । ';

const questions = [
  {
    question: 'গত দুই সপ্তাহে আমি উৎফুল্ল এবং উৎসাহিতবোধ করেছি',
    options: getAnswers([0, 1, 2, 3, 4, 5]),
  },
  {
    question: 'গত দুই সপ্তাহে আমি শান্ত এবং হালকা বোধ করেছি',
    options: getAnswers([0, 1, 2, 3, 4, 5]),
  },
  {
    question: 'গত দুই সপ্তাহে আমি কর্মক্ষম এবং সজীব অনুভব করেছি',
    options: getAnswers([0, 1, 2, 3, 4, 5]),
  },
  {
    question: 'গত দুই সপ্তাহে সতেজ এবং আরামের অনুভূতি নিয়ে আমি ঘুম থেকে জেগে উঠেছি',
    options: getAnswers([0, 1, 2, 3, 4, 5]),
  },
  {
    question: 'গত দুই সপ্তাহে আমি যা কিছু পছন্দ করি তা দিয়ে আমার দৈনন্দিন জীবন পূর্ণ রয়েছে',
    options: getAnswers([0, 1, 2, 3, 4, 5]),
  },
];

export default questions;
