import YesNo from './YesNo';

export default {
  questions: [
    {
      question:
        'আপনার কি মনে হয় মানুষ ইচ্ছাকৃত ভাবে আপনার ক্ষতি করতে চাচ্ছে অথবা আপনার বিরুদ্ধে ষড়যন্ত্র করছে?',
      options: YesNo,
    },
    {
      question:
        'আপনার কি মনে হয় কোন কিছু বা অন্য কোন ব্যক্তি আপনার চিন্তাগুলোকে সরাসরি নিয়ন্ত্রণ করছে?',
      options: YesNo,
    },
    {
      question:
        'আপনার কি এরকম মনে হয় যে অস্বাভাবিক কিছু একটা ঘটছে, তবে অন্য কেউ বিশ্বাস করছে না?',
      options: YesNo,
    },
    {
      question:
        'আপনি কি এমন কিছু দেখতে, শুনতে বা অনুভব করতে পারেন যেটা অন্য কেউ পারেনা?',
      options: YesNo,
    },
  ],
};
